app/controllers/prototypes_controller.rb

  def index
    @prototypes = Prototype.includes(:user)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2, 3)
SELECT `prototypes`.* FROM `prototypes`

  def create
    @prototype = Prototype.create(prototype_params)
    if @prototype.save
---
INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('tt', 'tt', '', 2, '2024-06-15 00:18:33.100897', '2024-06-15 00:18:33.100897')
UPDATE `prototypes` SET `prototypes`.`updated_at` = '2024-06-15 00:37:29.625184' WHERE `prototypes`.`id` = 8

  def show
    @prototype = Prototype.find(params[:id])
    @comment = Comment.new
    @comments = @prototype.comments.includes(:user)
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

  def update
    @prototype = Prototype.find(params[:id])
    if @prototype.update(prototype_params)
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
UPDATE `prototypes` SET `prototypes`.`updated_at` = '2024-06-19 09:01:45.612534' WHERE `prototypes`.`id` = 3

  def destroy
    prototype = Prototype.find(params[:id])
    prototype.destroy
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 9 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 9

  def move_to_index
    @prototype = Prototype.find(params[:id])
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 3 LIMIT 1